{
  "sideQuests":
  [
    ["Name1 Sings","You must get Name1 to join you in singing the words of a song."],
    ["Name1 Drinks","Name1 must drink an entire glass of water, can of soda, or any other drink, but it must be something that you brought to him1."],
    ["Name1 Eats","Name1 must eat a snack that you bring him1. Whatever it is, he1 must eat the entire thing."],
    ["Name1 Loves You","You must get Name1 to tell you he1 loves you. Context doesn't matter, but he1 must use the word \"love.\""],
    ["Jinx","You must \"jinx\" Name1. In other words, you must say a phrase at the exact same time that he1 does, and then yell \"Jinx!\" The particular phrase doesn't matter, but it must be more than one word long. THEN, you must ALSO \"jinx\" Name2."],
    ["Outside & Back In","If another player walks outside at any point in the game, you win when they come back in."],
    ["Bathroom Break","If Name1 or Name2 goes to the bathroom at any point in the game, you win when they come back."],
    ["Phone Call","If another player takes a phone call at any point, you win when they hang up."],
    ["Ask Name2","You must get Name1 to ask Name2 a question for you. Name1 must ask Name2 a question that you told him1 to ask."],
    ["Name1 Brings Food","If at any point Name1 brings you any food, you win."],
    ["Shoes","If at any point another player takes off, or puts on, shoes or sandals, you win."],
    ["Yawn","If another player opens his or her mouth to yawn at any point, you win when they finish yawning."],
    ["Photo Bomb","If at any point another player takes a picture (selfies count) that includes you in it, you win."],
    ["Show Picture", "If at any point another player shows you a picture saved on his or her phone, you win."],
    ["Social Media","If another player interacts with you on social media in any way during the game (liking a post, commenting, sending a friend request, etc.), you win."],
    ["Phone Number","If at any point another player gives you a phone number, theirs or somebody else's, you win."],
    ["Movie Quote","If Name1 quotes a movie at any point, you win."],
    ["Song Lyrics","If Name1 quotes the lyrics to a song at any point, you win."],
    ["Name1 Says \"I\"","Keep a running tally of how many times Name1 uses the word \"I\" or \"I'm.\" If it reaches 10, you win."],
    ["Like, Um, Uh","Keep a running tally of how many times Name1 says \"Like,\" \"Um,\" or \"Uh.\" If the tally reaches 10, you win."],
    ["Name1 Laughs","Keep a running tally of how many times Name1 laughs. If it gets to 6, you win."],
    ["100 Coins","You must acquire 100 coins. Coins that you spend don't count. You must have 100 coins in your balance to win this quest."],
    ["Name1's Behaviors","Observe Name1's behaviors for the following. If you can cross at least 3 off the list, you win.xxFolding his1 armsxxCrossing his1 legsxxCovering his1 mouthxxScratching his1 earxxCoughing"],
    ["Fart","If at any point you hear somebody else fart audibly, you win."],
    ["Stare","You must stare at people throughout the game.xxStare at someone until they ask what you're doing or why you're staring. Reply simply, \"I don't know,\" and look away.xxThe third time you do this successfully, you win."],
    ["Looking at Phones","Keep count to yourself of how many times other player's look at their phones. (If you're playing on a phone, this phone doesn't count.) If you get to 10, you win."],
    ["Dude","Get someone to draw attention to the fact that you're saying \"Dude\" a lot.xxHowever, you can't say it more than once per sentence. (For example, you can't just keep saying \"Dude, Dude, Dude\" until someone says something.)"],
    ["Keys","If another player takes keys out of their pocket, you win."],
    ["Gum","If you give Name1 gum or a mint and he1 accepts, you win the moment he1 puts it into his1 mouth."]
  ],
  "mainQuests": 
  [
    {
      "coins": 10,
      "pages": 
      [
        {
          "caption": "Name0, you have come across a chest containing 10 gold coins! However, Name1 is very jealous and wants to steal them from you!<br><br>You look around and see two possible places to hide them:<br><br>In the River<br><br>Inside the Cave<br><br>Secretly choose your hiding spot.",
          "options": 
          [
            {
              "caption": "River",
              "nextPage": 1
            },
            {
              "caption": "Cave",
              "nextPage": 2
            }
          ]
        },
        {
          "caption": "You have hidden the coins!<br><br>You may now say anything you would like to say to Name1 to influence his1 decision.<br><br>Pass your device to Name1 and allow him1 to select where he1 would like to look for the coins.<br><br>Name1, where are the coins?",
          "options": 
          [
            {
              "caption": "River",
              "nextPage": 3
            },
            {
              "caption": "Cave",
              "nextPage": 4
            }
          ]
        },
        {
          "caption": "You have hidden your coins!<br><br>You may now say anything you would like to say to Name1 to influence his1 decision.<br><br>Pass your device to Name1 and allow him1 to select where he1 would like to look for the coins.<br><br>Name1, where are the coins?",
          "options": 
          [
            {
              "caption": "River",
              "nextPage": 4
            },
            {
              "caption": "Cave",
              "nextPage": 3
            }
          ]
        },
        {
          "awards": [1],
          "caption": "Name1 has found the coins, and has stolen them for him1self!<br><br>Sorry, Name0!<br><br>Name1 is now 10 coins richer!",
          "options": 
          [
            {
              "caption": "Continue",
              "nextPage": 5
            }
          ]
        },
        {
          "awards": [0],
          "caption": "Name1 was not able to find the coins!<br><br>Congratulations, Name0!<br><br>You are now 10 coins richer!",
          "options": 
          [
            {
              "caption": "Continue",
              "nextPage": 5
            }
          ]
        }
      ]
    },

    {
      "coins": 10,
      "pages": 
      [
        {
          "caption": "Name0, you have been tasked with the important mission of poisoning Name1, for obvious reasons.<br><br>If you are successful in your mission, you will be rewarded with 10 coins, while Name1 will lose 20 coins in medical expenses.<br><br>If you are unsuccessful, you will be penalized 10 coins for failing your mission.<br><br>Now, time to poison Name1!<br><br>You have before you two silver goblets.<br><br>Secretly select which goblet will contain the poison.<br><br>Choose wisely!",
          "options": 
          [
            {
              "caption": "Goblet A",
              "nextPage": 1
            },
            {
              "caption": "Goblet B",
              "nextPage": 2
            }
          ]
        },
        {
          "caption": "You have successfully poisoned one of the goblets. You may now say whatever you would like to Name1 to influence his1 decision.<br><br>Pass your device to Name1 and allow him1 to select which goblet he1 will drink out of.<br><br>Name1, select your goblet.",
          "options": 
          [
            {
              "caption": "Goblet A",
              "nextPage": 3
            },
            {
              "caption": "Goblet B",
              "nextPage": 4
            }
          ]
        },
        {
          "caption": "You have successfully poisoned one of the goblets. You may now say whatever you would like to Name1 to influence his1 decision.<br><br>Pass your device to Name1 and allow him1 to select which goblet he1 will drink out of.<br><br>Name1, select your goblet.",
          "options": 
          [
            {
              "caption": "Goblet A",
              "nextPage": 4
            },
            {
              "caption": "Goblet B",
              "nextPage": 3
            }
          ]
        },
        {
          "awards": [0],
          "penalties": [1,1],
          "caption": "Name1 has been poisoned, costing him1 20 coins in medical expenses!<br><br>Name0 has been awarded 10 coins for successfully completing his0 mission!",
          "options": 
          [
            {
              "caption": "Continue",
              "nextPage": 5
            }
          ]
        },
        {
          "penalties": [0],
          "caption": "Name1 was not poisoned!<br><br>Name0 has failed his0 mission and has been penalized 10 coins!",
          "options": 
          [
            {
              "caption": "Continue",
              "nextPage": 5
            }
          ]
        }
      ]
    },

    {
      "coins": 10,
      "pages": 
      [
        {
          "caption": "Name0, you decide to go pillage a neighboring village. You enter the village, and it's filled with modest cottage homes, and one mansion.<br><br>You can get 10 coins from a cottage, but 20 coins from the mansion.<br><br>However, Name1 is following behind you to do some pillaging of his1 own!<br><br>There are plenty of cottages that you can each get 10 coins from. But if you BOTH try to pillage the mansion, the owner will wake up, chase you out, and you'll both end up with nothing.<br><br>Without revealing your decision, where do you decide to do your pillaging?",
          "options": 
          [
            {
              "caption": "Cottage",
              "nextPage": 1
            },
            {
              "caption": "Mansion",
              "nextPage": 2
            }
          ]
        },
        {
          "caption": "Here comes Name1! Don't tell him1 where you are!<br><br>Pass your device to Name1, and let him1 select where he1 chooses to pillage.",
          "options": 
          [
            {
              "caption": "Cottage",
              "nextPage": 3
            },
            {
              "caption": "Mansion",
              "nextPage": 4
            }
          ]
        },
        {
          "caption": "Here comes Name1! Don't tell him1 where you are!<br><br>Pass your device to Name1, and let him1 select where he1 chooses to pillage.",
          "options": 
          [
            {
              "caption": "Cottage",
              "nextPage": 5
            },
            {
              "caption": "Mansion",
              "nextPage": 6
            }
          ]
        },
        {
          "awards": [0,1],
          "caption": "You each chose to pillage small cottages in the village!<br><br>You each get away with 10 coins!",
          "options": 
          [
            {
              "caption": "Continue",
              "nextPage": 7
            }
          ]
        },
        {
          "awards": [0,1,1],
          "caption": "While Name0 played it safe and made out with 10 coins from a small cottage, Name1 went for the mansion and successfully got out with 20!",
          "options": 
          [
            {
              "caption": "Continue",
              "nextPage": 7
            }
          ]
        },
        {
          "awards": [0,0,1],
          "caption": "While Name1 played it safe and made out with 10 coins from a small cottage, Name0 went for the mansion and successfully got out with 20!",
          "options": 
          [
            {
              "caption": "Continue",
              "nextPage": 7
            }
          ]
        },
        {
          "caption": "You both went for the mansion!<br><br>The owner of the mansion woke up and chased the two of you out with a pitchfork!",
          "options": 
          [
            {
              "caption": "Continue",
              "nextPage": 7
            }
          ]
        }

      ]
    },

    {
      "coins": 10,
      "pages": 
      [
        {
          "caption": "Name0, the local village is holding an eating competition, and you and Name1 are finalists!xxThe grand prize is 10 gold coins!xxHere's what you need to do.xxGo to the kitchen, the pantry, your hidden stash, or wherever you keep food. Find two identical food items.xxName2 can be the judge, when he2 says go, the first one to finish eating wins the prize!",
          "options": 
          [
            {
              "caption": "Continue",
              "nextPage": 1
            }
          ]
        },
        {
          "caption": "Name2, when they're finished, tell us who the winner is!",
          "options": 
          [
            {
              "caption": "Name0",
              "nextPage": 2
            },
            {
              "caption": "Name1",
              "nextPage": 3
            }
          ]
        },
        {
          "awards": [0],
          "caption": "Congratulations, Name0!xxYou've won 10 coins!",
          "options": 
          [
            {
              "caption": "Continue",
              "nextPage": 4
            }
          ]
        },
        {
          "awards": [1],
          "caption": "Congratulations, Name1!xxYou've won 10 coins!",
          "options": 
          [
            {
              "caption": "Continue",
              "nextPage": 4
            }
          ]
        }
      ]
    },
    
    {
      "coins": 10,
      "pages": 
      [
        {
          "caption": "Name0, you and Name1 have successfully robbed the village treasury and gotten out with 10 coins each!xxHowever, the law was not far behind! Both of you have been brought in by the warden for questioning to find out who was behind the robbery.xxLuckily for you, there is not enough evidence to convict either one of you without an eyewitness.xxIf neither of you says anything, you're both let go and get away with 10 coins each!xxHowever, there is a reward of 10 coins for any information that leads to an arrest.xxIf one of you rats out the other, they'll walk away with the reward in addition to their 10 coins, for a total of 20! The other will lose all the coins they stole and be fined 10 coins.xxHowever, if both of you rats out the other, you'll both walk away with nothing.xxAfter discussing what you plan on doing, Name0, secretly select your choice:",
          "options": 
          [
            {
              "caption": "Keep quiet",
              "nextPage": 1
            },
            {
              "caption": "Rat him1 out",
              "nextPage": 2
            }
          ]
        },
        {
          "caption": "Now pass your device to Name1.xxName1, what do you do?",
          "options": 
          [
            {
              "caption": "Keep quiet",
              "nextPage": 3
            },
            {
              "caption": "Rat him0 out",
              "nextPage": 4
            }
          ]
        },
        {
          "caption": "Now pass your device to Name1.xxName1, what do you do?",
          "options": 
          [
            {
              "caption": "Keep quiet",
              "nextPage": 5
            },
            {
              "caption": "Rat him0 out",
              "nextPage": 6
            }
          ]
        },
        {
          "awards": [0,1],
          "caption": "You have both been released with insufficient evidence to convict either one of you!xxCongratulations! You both walk away with 10 coins!",
          "options": 
          [
            {
              "caption": "Continue",
              "nextPage": 7
            }
          ]
        },
        {
          "awards": [1,1],
          "penalties": [0],
          "caption": "The warden has been provided the evidence needed to convict Name0!xxHis0 penalty?xx10 coins.xxMeanwhile, Name1 walks away with 20!",
          "options": 
          [
            {
              "caption": "Continue",
              "nextPage": 7
            }
          ]
        },
        {
          "awards": [0,0],
          "penalties": [1],
          "caption": "The warden has been provided the evidence needed to convict Name1!xxHis1 penalty?xx10 coins.xxMeanwhile, Name0 walks away with 20!",
          "options": 
          [
            {
              "caption": "Continue",
              "nextPage": 7
            }
          ]
        },
        {
          "caption": "There is no honor among theives!xxYou both ratted each other out!xxYou each walk away with nothing.",
          "options": 
          [
            {
              "caption": "Continue",
              "nextPage": 7
            }
          ]
        }
      ]
    },


    {
      "coins": 8,
      "pages": 
      [
        {
          "caption": "Name1 has been comissioned to compile the village's new official dictionary of words, but he1 needs one more entry to complete it.xxPass your device to Name1.",
          "options": 
          [
            {
              "caption": "Continue",
              "nextPage": 1
            }
          ]
        },
        {
          "caption": "Name1, make up a funny sounding word. Then give Name0 and Name2 each an opportunity to define the word.xxWhen they're done, select the winning entry. The winner is awarded 8 coins.",
          "options": 
          [
            {
              "caption": "Name0",
              "nextPage": 2
            },
            {
              "caption": "Name2",
              "nextPage": 3
            }
          ]
        },
        {
          "awards": [0],
          "caption": "Congratulations, Name0!xxYour most excellent definition has been recorded in the Official Name1's Dictionary and preserved for generations to come!xxYou've been awarded 8 coins.",
          "options": 
          [
            {
              "caption": "Continue",
              "nextPage": 4
            }
          ]
        },
        {
          "awards": [2],
          "caption": "Congratulations, Name2!xxYour most excellent definition has been recorded in the Official Name1's Dictionary and preserved for generations to come!xxYou've been awarded 8 coins.",
          "options": 
          [
            {
              "caption": "Continue",
              "nextPage": 4
            }
          ]
        }
      ]
    },

    {
      "coins": 10,
      "pages": 
      [
        {
          "caption": "The time has come once again for the annual Arm Wrestling Competition. Name0 and Name1 are the finalists. The prize is 10 gold coins.xxName2 is the judge. Pass him2 the device.",
          "options": 
          [
            {
              "caption": "Continue",
              "nextPage": 1
            }
          ]
        },
        {
          "caption": "Name2, facilitate the arm wresting competition between Name0 and Name1, and then select the winner.",
          "options": 
          [
            {
              "caption": "Name0",
              "nextPage": 2
            },
            {
              "caption": "Name1",
              "nextPage": 3
            }
          ]
        },
        {
          "awards": [0],
          "caption": "Congratulations, Name0!xxYou are the arm wrestling champion! You've been awarded 10 coins!",
          "options": 
          [
            {
              "caption": "Continue",
              "nextPage": 4
            }
          ]
        },
        {
          "awards": [1],
          "caption": "Congratulations, Name1!xxYou are the arm wrestling champion! You've been awarded 10 coins!",
          "options": 
          [
            {
              "caption": "Continue",
              "nextPage": 4
            }
          ]
        }
      ]
    },

    {
      "coins": 20,
      "pages": 
      [
        {
          "caption": "Name0 and Name1, you have come across a sleeping dragon. Whatever you do, don't wake him up! If you do, he'll attack, and you'll escape with only the clothes you have on. All of your coins will be lost.xxPass the device to Name2 and have him2 press Continue to read the next page of instructions.",
          "options": 
          [
            {
              "caption": "Continue",
              "nextPage": 1
            }
          ]
        },
        {
          "caption": "Name2, Name0 and Name1 must remain absolutely quiet for one minute. If either one of them makes any noise, the dragon wakes up.xxOther players are allowed to talk and do anything they would like for the 30 seconds, as long as they don't touch Name0 or Name1.xxReady?xxStart the timer!",
          "options": 
          [
            {
              "caption": "Start Timer",
              "timer": 30,
              "nextPage": 2
            }
          ]
        },
        {
          "caption": "Name2,xxBe honest.xxWere they successful?",
          "options": 
          [
            {
              "caption": "Yes",
              "nextPage": 3
            },
            {
              "caption": "No",
              "nextPage": 4
            }
          ]
        },
        {
          "awards": [0,1],
          "caption": "Congratulations, Name0 and Name1!xxYou have escaped the dragon! Tales of your bravery swept through the land, and you were each awarded the medal of bravery along with 20 coins!",
          "options": 
          [
            {
              "caption": "Continue",
              "nextPage": 5
            }
          ]
        },
        {
          "penalties": [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
          "caption": "The dragon woke up!xxThe fight was brutal. Name0 and Name1, sorry, but you've lost all your coins.",
          "options": 
          [
            {
              "caption": "Continue",
              "nextPage": 5
            }
          ]
        }
    ]},

    {
      "coins": 8,
      "pages": 
      [
        {
          "caption": "Name0,xxAs you know, Name1 has not been laughing enough. This needs to change.xxFor a reward of 8 coins, you've been assigned the task of making Name1 laugh.xxPass the device to Name2 to read the next page of instructions.",
          "options": 
          [
            {
              "caption": "Continue",
              "nextPage": 1
            }
          ]
        },
        {
          "caption": "Name2, you will be the judge. Here are the rules.xxName0 has 30 seconds to make Name1 laugh.xxHe0 can't touch him1, but other than that, he0 can do whatever it takes to get Name1 to laugh.xxWhen Name0 is ready, start the timer!",
          "options": 
          [
            {
              "caption": "Start Timer",
              "timer": 30,
              "nextPage": 2
            }
          ]
        },
        {
          "caption": "Name2, did Name1 laugh?",
          "options": 
          [
            {
              "caption": "Yes",
              "nextPage": 3
            },
            {
              "caption": "No",
              "nextPage": 4
            }
          ]
        },
        {
          "awards": [0],
          "caption": "Congratulations, Name0!xxYou have succeeded in your mission and have been awarded 8 coins!",
          "options": 
          [
            {
              "caption": "Continue",
              "nextPage": 4
            }
          ]
        }
    ]},

    {
      "coins": 10,
      "pages": 
      [
        {
          "caption": "The whole village has gathered to watch the annual Staring Competition between Name0 and Name1. The prize is 10 gold coins.xxName2 is the judge. Pass him2 the device.",
          "options": 
          [
            {
              "caption": "Continue",
              "nextPage": 1
            }
          ]
        },
        {
          "caption": "Name2, facilitate the staring competition between Name0 and Name1, and then select the winner.",
          "options": 
          [
            {
              "caption": "Name0",
              "nextPage": 2
            },
            {
              "caption": "Name1",
              "nextPage": 3
            }
          ]
        },
        {
          "awards": [0],
          "caption": "Congratulations, Name0!xxYou are the staring champion! You've been awarded 10 coins!",
          "options": 
          [
            {
              "caption": "Continue",
              "nextPage": 4
            }
          ]
        },
        {
          "awards": [1],
          "caption": "Congratulations, Name1!xxYou are the staring champion! You've been awarded 10 coins!",
          "options": 
          [
            {
              "caption": "Continue",
              "nextPage": 4
            }
          ]
        }
      ]
    },

    {
      "coins": 10,
      "pages": 
      [
        {
          "caption": "Name0, Name1 is in danger! There is a flock of wild animals heading in his1 direction and you need to warn him1!xxUnfortunately, on your way, you trip and fall face first into a pool of acid. You can no longer speak or see, and your only option is to draw the kind of animal that's coming with your eyes shut.xxGrab some paper and something to draw with, and pass the device to Name2 to read the next page of instructions.xx(If there is absolutely nothing available to draw with, press Forfeit.)",
          "options": 
          [
            {
              "caption": "Continue",
              "nextPage": 1
            },
            {
              "caption": "Forfeit",
              "nextPage": 10
            }
          ]
        },
        {
          "caption": "Name2, you get to decide what kind of animal Name0 has to draw. Whisper to him0 the animal, then press Start Timer to give him0 30 seconds to draw.xxName0 has to keep his0 eyes shut the entire time, and Name1 has to guess what he0's drawing. If they are successful, they both earn 10 coins. Otherwise, the lose 10.",
          "options": 
          [
            {
              "caption": "Start Timer",
              "timer": 30,
              "nextPage": 2
            }
          ]
        },
        {
          "caption": "How did it go?",
          "options": 
          [
            {
              "caption": "Good",
              "nextPage": 3
            },
            {
              "caption": "Bad",
              "nextPage": 4
            }
          ]
        },
        {
          "awards": [0,1],
          "caption": "Congratulations, Name0 and Name1! You each win 10 coins.",
          "options": 
          [
            {
              "caption": "Continue",
              "nextPage": 5
            }
          ]
        },
        {
          "penalties": [0,1],
          "caption": "Sorry, Name0 and Name1! You each lose 10 coins.",
          "options": 
          [
            {
              "caption": "Continue",
              "nextPage": 5
            }
          ]
        }
    ]},
    {"coins": 10, "pages": [{"caption": "Name0, you have been corresponding with one of the villages most dangerous criminals, Demetrius, who has offered you 10 coins to break him out of prison. You just need a key.", "options": [{"caption": "Continue", "nextPage": 1}]}, {"caption": "If you can show that you have at least one key with you, press Yes to break Demetrius free.", "options": [{"caption": "Yes", "nextPage": 2}, {"caption": "No", "nextPage": 3}]}, {"awards": [0], "caption": "You break Demetrius out of prison, and in return, he gives you 10 coins!", "options": [{"caption": "Continue", "nextPage": 10}]}, {"caption": "Bad luck!xxBetter start carrying your keys with you!", "options": [{"caption": "Continue", "nextPage": 10}]}]},

    {"coins": 5, "pages": [{"caption": "Name0, look in your pocket (or wherever you keep money). Do you have any change?xxIf so, you've earned yourself 5 coins!", "options": [{"caption": "Yes", "nextPage": 1}, {"caption": "No", "nextPage": 2}]}, {"awards": [0], "caption": "You've earned 5 coins. If you can produce exactly 68 cents in change, we'll make it 20!xxFrom the change you have, can you make exactly 68 cents?", "options": [{"caption": "Yes", "nextPage": 3}, {"caption": "No", "nextPage": 4}]}, {"caption": "Better luck next time!", "options": [{"caption": "Continue", "nextPage": 10}]}, {"awards": [0,0,0], "caption": "Congratulations, Name0!xxYou win 20 coins!", "options": [{"caption": "Continue", "nextPage": 10}]}, {"caption": "Too bad.xxBut we'll give you another chance!xxIf you can get the change you need from Name1 or Name2, you and whichever one of them helps you out can split the 20!", "options": [{"caption": "Continue", "nextPage": 5}]}, {"caption": "Are you able to produce exactly 68 cents with help from Name1 or Name2?", "options": [{"caption": "Yes", "nextPage": 6}, {"caption": "No", "nextPage": 7}]}, {"awards": [0], "caption": "Great!xxWho gave you the change you needed?", "options": [{"caption": "Name1", "nextPage": 8}, {"caption": "Name2", "nextPage": 9}]}, {"caption": "That's okay. You still won 5 coins!", "options": [{"caption": "Continue", "nextPage": 10}]}, {"awards": [1,1], "caption": "Congratulations, Name0 and Name1!xxYou each win 10 coins!", "options": [{"caption": "Continue", "nextPage": 10}]}, {"awards": [2,2], "caption": "Congratulations, Name0 and Name2!xxYou each win 10 coins!", "options": [{"caption": "Continue", "nextPage": 10}]}]},

    {"coins": 10, "pages": [{"caption": "Name0, you have a date tonight with a very wealthy villager, who will give you 10 coins if you make a good impression. But to do this, you need fresh breath!xxIf you have gum or mints, or can acquire one or the other, you succeed in this challenge.", "options": [{"caption": "Continue", "nextPage": 1}]}, {"caption": "Were you able to get gum or a mint?", "options": [{"caption": "Yes", "nextPage": 2}, {"caption": "No", "nextPage": 3}]}, {"awards": [0], "caption": "Congratulations, Name0!xxYour date was fantasic!xx Have 10 coins!", "options": [{"caption": "Continue", "nextPage": 10}]}, {"caption": "You failed to impress your date with your bad breath. xxSorry!", "options": [{"caption": "Continue", "nextPage": 10}]}]},

    {"coins": 12, "pages": [{"caption": "Name0, the new sandwich shop in town is hiring. But you need to prove your sandwich-making skills!xxYou have 45 seconds to make a sandwich for another player. If you come back in 45 seconds with a sandwich, you've earned 12 coins!", "options": [{"timer": 45, "caption": "Start Timer", "nextPage": 1}, {"caption": "Pass", "nextPage": 10}]}, {"caption": "Did Name0 come back with a sandwich and give it to another player?", "options": [{"caption": "Yes", "nextPage": 2}, {"caption": "No", "nextPage": 10}]}, {"awards": [0], "caption": "Congratulations, Name0!xxYou win 12 coins!", "options": [{"caption": "Continue", "nextPage": 10}]}]},

    {"coins": 8, "pages": [{"caption": "Name0, we need evidence that you were here! If you post a picture on social media right now (Facebook, Snapchat, Instagram...), you win 8 coins!", "options": [{"caption": "Done", "nextPage": 1}, {"caption": "Pass", "nextPage": 10}]}, {"awards": [0], "caption": "You win 8 coins!xxIf you get at least one interaction in the next 30 seconds, we'll double it!xx(likes, views, reacts, etc.)xxOther players count!", "options": [{"timer": 30, "caption": "Start Timer", "nextPage": 2}, {"caption": "I'm Good", "nextPage": 10}]}, {"caption": "Did you get any interactions on your photo?", "options": [{"caption": "Yes", "nextPage": 3}, {"caption": "No", "nextPage": 4}]}, {"awards": [0], "caption": "You've earned 16 coins!", "options": [{"caption": "Continue", "nextPage": 10}]}, {"caption": "That's okay! You still got 8 coins!", "options": [{"caption": "Continue", "nextPage": 10}]}]},

    {"coins": 10, "pages": [{"caption": "Name0, you get to decide who deserves the next 10 coins:xxName1 or Name2xxYou get to decide the criteria for who gets the points, but you get no more than 30 seconds to make your decision.", "options": [{"timer": 30, "caption": "Start Timer", "nextPage": 1}]}, {"caption": "We need a decision.xxWho gets the coins?", "options": [{"caption": "Name1", "nextPage": 2}, {"caption": "Name2", "nextPage": 3}]}, {"awards": [1], "caption": "Pass the device to Name1.", "options": [{"caption": "Continue", "nextPage": 4}]}, {"awards": [2], "caption": "Pass the device to Name2.", "options": [{"caption": "Continue", "nextPage": 5}]}, {"caption": "Congratulation, Name1!xxYou earned 10 coins, based on whatever criteria Name0 thought was fair.xxNow it's up to you to decide, should Name0 also get 10 coins?", "options": [{"caption": "Yes", "nextPage": 6}, {"caption": "No", "nextPage": 10}]}, {"caption": "Congratulation, Name2!xxYou earned 10 coins, based on whatever criteria Name0 thought was fair.xxNow it's up to you to decide, should Name0 also get 10 coins?", "options": [{"caption": "Yes", "nextPage": 6}, {"caption": "No", "nextPage": 10}]}, {"awards": [0], "caption": "Congratulations, Name0!xxYou get 10 coins!", "options": [{"caption": "Continue", "nextPage": 10}]}]},

    {"coins": 12, "pages": [{"caption": "Name0, the village is opening up a new museum and is looking for interesting artifacts. You and Name1 will each compete to find the most interesting artifacts to present to Name2.xxPass the device to Name2 to read the next page of instructions.", "options": [{"caption": "Continue", "nextPage": 1}]}, {"caption": "Name0 and Name1 have 30 seconds to find artifacts to present.xxThey can find items from around the room, from outside, something they left in their car, wherever! But when time runs out, it's time to present!xxThe winner gets 12 coins.", "options": [{"timer": 30, "caption": "Start Timer", "nextPage": 2}]}, {"caption": "Name0 now has 15 seconds to present his0 artifact and explain why it deserves a spot in the museum.", "options": [{"timer": 15, "caption": "Start Timer", "nextPage": 3}]}, {"caption": "And now, Name1 has 15 seconds to present his1 artifact and explain why it deserves a spot.", "options": [{"timer": 15, "caption": "Start Timer", "nextPage": 4}]}, {"caption": "And now, Name2, you decide.xxWhose artifact belongs in the museum?", "options": [{"caption": "Name0's", "nextPage": 5}, {"caption": "Name1's", "nextPage": 6}]}, {"awards": [0], "caption": "Congratulations, Name0!xxYou win 12 coins!", "options": [{"caption": "Continue", "nextPage": 10}]}, {"awards": [1], "caption": "Congratulations, Name1!xxYou win 12 coins!", "options": [{"caption": "Continue", "nextPage": 10}]}]},

    {"coins": 10, "pages": [{"caption": "Name0, the village is holding a paper airplane competition with a prize of 10 coins, and it's come down to you and Name1.xxPass the device to Name2 to read the next page of instructions.xx(If you don't have any access to paper, press Forfeit.)", "options": [{"caption": "Continue", "nextPage": 1}, {"caption": "Forfeit", "nextPage": 10}]}, {"caption": "Name2, Name0 and Name1 have 20 seconds to make a paper airplane. As soon as they both have paper, start the timer.", "options": [{"timer": 20, "caption": "Start Timer", "nextPage": 2}]}, {"caption": "Name2, you decide where the throw line is. (Go outside if you think you need more room.)xxEach player will throw their airplane from the throw line. Whichever plane lands the farthest ahead is the winning plane.", "options": [{"caption": "Continue", "nextPage": 3}]}, {"caption": "Whose plane landed farthest ahead?", "options": [{"caption": "Name0's", "nextPage": 4}, {"caption": "Name1's", "nextPage": 5}]}, {"awards": [0], "caption": "Congratulations, Name0!xxYou win 10 coins!", "options": [{"caption": "Continue", "nextPage": 10}]}, {"awards": [1], "caption": "Congratulations, Name1!xxYou win 10 coins!", "options": [{"caption": "Continue", "nextPage": 10}]}]}


  ]
}